In [1]:
import pandas as pd
import numpy as np
from matplotlib import pyplot as plt
from sklearn.preprocessing import LabelEncoder
from sklearn.model_selection import train_test_split
from sklearn import tree
from sklearn.metrics import confusion_matrix

In [2]:
df = pd.read_csv('titanic.csv')
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0
...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
dtypes: float64(1), int64(5), object(2)
memory usage: 55.8+ KB

In [4]:
df.Age.value_counts()

24.00    30
22.00    27
18.00    26
19.00    25
28.00    25
         ..
36.50     1
55.50     1
0.92      1
23.50     1
74.00     1
Name: Age, Length: 88, dtype: int64

In [5]:
df.Age.isnull().sum()

177

In [6]:
mean = df.Age.mean()

In [7]:
df.Age.fillna(mean, inplace = True)
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch
0,1,0,3,"Braund, Mr. Owen Harris",male,22.000000,1,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.000000,1,0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.000000,0,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.000000,1,0
4,5,0,3,"Allen, Mr. William Henry",male,35.000000,0,0
...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.000000,0,0
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.000000,0,0
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,29.699118,1,2
889,890,1,1,"Behr, Mr. Karl Howell",male,26.000000,0,0
890,891,0,3,"Dooley, Mr. Patrick",male,32.000000,0,0

In [8]:
df.Age.isnull().sum()

0

In [9]:
le = LabelEncoder()
dfle = df
dfle.Sex = le.fit_transform(dfle.Sex)

In [10]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch
0,1,0,3,"Braund, Mr. Owen Harris",1,22.000000,1,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,38.000000,1,0
2,3,1,3,"Heikkinen, Miss. Laina",0,26.000000,0,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,35.000000,1,0
4,5,0,3,"Allen, Mr. William Henry",1,35.000000,0,0
...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",1,27.000000,0,0
887,888,1,1,"Graham, Miss. Margaret Edith",0,19.000000,0,0
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",0,29.699118,1,2
889,890,1,1,"Behr, Mr. Karl Howell",1,26.000000,0,0
890,891,0,3,"Dooley, Mr. Patrick",1,32.000000,0,0

In [11]:
target = df.Survived
target

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64

In [12]:
features = df.drop(['Name', 'Survived'], axis = 1)
features

     PassengerId  Pclass  Sex        Age  SibSp  Parch
0              1       3    1  22.000000      1      0
1              2       1    0  38.000000      1      0
2              3       3    0  26.000000      0      0
3              4       1    0  35.000000      1      0
4              5       3    1  35.000000      0      0
..           ...     ...  ...        ...    ...    ...
886          887       2    1  27.000000      0      0
887          888       1    0  19.000000      0      0
888          889       3    0  29.699118      1      2
889          890       1    1  26.000000      0      0
890          891       3    1  32.000000      0      0

[891 rows x 6 columns]

In [13]:
x_train, x_test, y_train, y_test = train_test_split(features, target, test_size = 0.2)

In [14]:
len(x_train)

712

In [15]:
len(y_train)

712

In [16]:
x_train.head()

     PassengerId  Pclass  Sex        Age  SibSp  Parch
346          347       2    0  40.000000      0      0
391          392       3    1  21.000000      0      0
177          178       1    0  50.000000      0      0
737          738       1    1  35.000000      0      0
304          305       3    1  29.699118      0      0

In [17]:
y_test

197    0
94     0
251    0
843    0
777    1
      ..
854    0
171    0
751    1
55     1
283    1
Name: Survived, Length: 179, dtype: int64

In [18]:
model = tree.DecisionTreeClassifier()

In [19]:
model.fit(x_train, y_train)

DecisionTreeClassifier()

In [20]:
model.score(x_test, y_test) * 100

75.41899441340783

In [21]:
result = model.predict(x_test)

In [22]:
cm = confusion_matrix(y_test, result)
cm

array([[93, 20],
       [24, 42]], dtype=int64)

# Titanic:- approx. 75% accuracy with Decision Tree Model